# Division A

In [1]:
div_a_scores_dictionary = {"student_name": ["Jay", "Aaryan", "Sahil","Riya","Shubh"],
                         "math_scores": [20,56,76,78,90],
                         "chemistry_scores": [32,36,78,23,100],
                         "information_technology_scores": [34,6,88,100,45],
                         "physics_scores": [6,88,48,90,25]
                         }

In [2]:
div_a_emails_dictionary = {"student_name": ["Jay", "Aaryan", "Sahil","Riya","Shubh"],
                           "student_email": ["Jay@gmail.com", "Aaryan@gmail.com", "Sahil@gmail.com","Riya@gmail.com","Shubh@gmail.com"]
                         }

# Division B

In [3]:
div_b_scores_dictionary = {"student_name": ["Jai", "Aryan", "Firoz","Steve","Rhea"],
                         "math_scores": [32,56,76,78,90],
                         "chemistry_scores": [32,56,75,23,10],
                         "information_technology_scores": [34,6,48,100,45],
                         "physics_scores": [6,88,58,90,25]
                         }

In [4]:
div_b_emails_dictionary = {"student_name": ["Jai", "Aryan", "Firoz","Steve","Rhea"],
                            "student_email": ["Jai@gmail.com", "Aryan@gmail.com", "Firoz@gmail.com","Steve@gmail.com","Rhea@gmail.com"]
                         }

# Division C

In [5]:
div_c_scores_dictionary = {"student_name": ["Kareena", "Alia", "Priyanka","Shahrukh","Salman"],
                         "math_scores": [22,56,76,78,90],
                         "chemistry_scores": [30,56,78,23,100],
                         "information_technology_scores": [34,6,98,100,40],
                         "physics_scores": [60,88,58,90,25]
                         }

In [6]:
div_c_emails_dictionary = {"student_name": ["Kareena", "Alia", "Priyanka","Shahrukh","Salman"],
                            "student_email": ["Kareena@gmail.com", "Alia@gmail.com", "Priyanka@gmail.com","Shahrukh@gmail.com","Salman@gmail.com"]
                         }

# Functions

In [35]:
#set up 
import pandas as pd

In [36]:
#get scores

def get_scores(report_card_dictionary, division_name):
    
    #convert the dictionary into dataframe 
    report_card_df = pd.DataFrame(report_card_dictionary)
    
    #add a coloumn called division (e.g A, B, C) 
    report_card_df["division"] = division_name
    
    #add a coloumn called total score (0 to 400)
    report_card_df["total_score"] = report_card_df["math_scores"] + report_card_df["chemistry_scores"] + report_card_df["physics_scores"] + report_card_df["information_technology_scores"]
    
    #add a column called average score (0 to 100)
    report_card_df["average_scores"] = report_card_df["total_score"]/4
    
    #add a column called status (pass or fail)
    report_card_df.loc[report_card_df["average_scores"] >=35, "status"] = "Pass"
    report_card_df.loc[report_card_df["average_scores"] <35, "status"] = "fail"
    
    #add a column called character grade ( A, B, C, D, F)
    report_card_df.loc[report_card_df["average_scores"] >=90, "character_grade"] = "A"
    report_card_df.loc[(report_card_df["average_scores"] >=70) & (report_card_df["average_scores"] <90), "character_grade"] = "B"
    report_card_df.loc[(report_card_df["average_scores"] >=50) & (report_card_df["average_scores"] <70), "character_grade"] = "C"
    report_card_df.loc[(report_card_df["average_scores"] >=35) & (report_card_df["average_scores"] <50), "character_grade"] = "D"
    report_card_df.loc[report_card_df["average_scores"] <35, "character_grade"] = "F"
    
    #return the dataframe 
    return report_card_df

In [43]:
division_a_report_card_df = get_scores(div_a_scores_dictionary, "A")
division_a_report_card_df

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores,division,total_score,average_scores,status,character_grade
0,Jay,20,32,34,6,A,92,23.00,fail,F
1,Aaryan,56,36,6,88,A,186,46.50,Pass,D
2,Sahil,76,78,88,48,A,290,72.50,Pass,B
3,Riya,78,23,100,90,A,291,72.75,Pass,B
4,Shubh,90,100,45,25,A,260,65.00,Pass,C

GET EMAILS FUNCTION

In [44]:
#

def get_emails(emails_dictionary, division_name):
    
    #converting the dictionary into a dataframe
    emails_df = pd.DataFrame(emails_dictionary)
    
    #creating a column called division 
    emails_df["division"] = division_name
    
    #converting all string functions in the student email column to lower case
    emails_df["student_email"] = emails_df["student_email"].str.lower()
    
    #return the dataframe
    return emails_df

In [45]:
div_a_emails_df = get_emails(div_a_emails_dictionary, "A")
div_a_emails_df

  student_name     student_email division
0          Jay     jay@gmail.com        A
1       Aaryan  aaryan@gmail.com        A
2        Sahil   sahil@gmail.com        A
3         Riya    riya@gmail.com        A
4        Shubh   shubh@gmail.com        A

GET SCORES AND EMAIL FUNCTION

In [52]:
def get_scores_and_emails_combined(report_card_df, emails_df):
    report_card_with_emails_df = pd.merge(report_card_df, emails_df, how = "left", on = ["student_name", "division"])
    return report_card_with_emails_df

In [53]:
get_scores_and_emails_combined(division_a_report_card_df, div_a_emails_df)

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores,division,total_score,average_scores,status,character_grade,student_email
0,Jay,20,32,34,6,A,92,23.00,fail,F,jay@gmail.com
1,Aaryan,56,36,6,88,A,186,46.50,Pass,D,aaryan@gmail.com
2,Sahil,76,78,88,48,A,290,72.50,Pass,B,sahil@gmail.com
3,Riya,78,23,100,90,A,291,72.75,Pass,B,riya@gmail.com
4,Shubh,90,100,45,25,A,260,65.00,Pass,C,shubh@gmail.com

GET ALL DIVISIONS SCORESHEET

In [54]:
div_a_scores_df = get_scores(div_a_scores_dictionary, "A")
div_a_emails_df = get_emails(div_a_emails_dictionary, "A")
div_a_combined_df = get_scores_and_emails_combined(div_a_scores_df, div_a_emails_df)
div_a_combined_df

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores,division,total_score,average_scores,status,character_grade,student_email
0,Jay,20,32,34,6,A,92,23.00,fail,F,jay@gmail.com
1,Aaryan,56,36,6,88,A,186,46.50,Pass,D,aaryan@gmail.com
2,Sahil,76,78,88,48,A,290,72.50,Pass,B,sahil@gmail.com
3,Riya,78,23,100,90,A,291,72.75,Pass,B,riya@gmail.com
4,Shubh,90,100,45,25,A,260,65.00,Pass,C,shubh@gmail.com

In [55]:
div_b_scores_df = get_scores(div_b_scores_dictionary, "B")
div_b_emails_df = get_emails(div_b_emails_dictionary, "B")
div_b_combined_df = get_scores_and_emails_combined(div_b_scores_df, div_b_emails_df)
div_b_combined_df

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores,division,total_score,average_scores,status,character_grade,student_email
0,Jai,32,32,34,6,B,104,26.00,fail,F,jai@gmail.com
1,Aryan,56,56,6,88,B,206,51.50,Pass,C,aryan@gmail.com
2,Firoz,76,75,48,58,B,257,64.25,Pass,C,firoz@gmail.com
3,Steve,78,23,100,90,B,291,72.75,Pass,B,steve@gmail.com
4,Rhea,90,10,45,25,B,170,42.50,Pass,D,rhea@gmail.com

In [56]:
div_c_scores_df = get_scores(div_c_scores_dictionary, "C")
div_c_emails_df = get_emails(div_c_emails_dictionary, "C")
div_c_combined_df = get_scores_and_emails_combined(div_c_scores_df, div_c_emails_df)
div_c_combined_df

,student_name,math_scores,chemistry_scores,information_technology_scores,physics_scores,division,total_score,average_scores,status,character_grade,student_email
0,Kareena,22,30,34,60,C,146,36.50,Pass,D,kareena@gmail.com
1,Alia,56,56,6,88,C,206,51.50,Pass,C,alia@gmail.com
2,Priyanka,76,78,98,58,C,310,77.50,Pass,B,priyanka@gmail.com
3,Shahrukh,78,23,100,90,C,291,72.75,Pass,B,shahrukh@gmail.com
4,Salman,90,100,40,25,C,255,63.75,Pass,C,salman@gmail.com

In [59]:
def get_all_divisions_scoresheet(div_a_df, div_b_df, div_c_df):
    all_divisions_df = pd.concat([div_a_df, div_b_df, div_c_df], ignore_index = True)
    return all_divisions_df

In [60]:
main_grade_sheet = get_all_divisions_scoresheet(div_a_combined_df, div_b_combined_df, div_c_combined_df)
main_grade_sheet.to_csv("Main Grade Sheet.csv")